[
  "I've never done it without wanting to.",
  "I've never done it with more than one person in the same day.",
  "I've never wanted to sleep with a friend's mother/father.",
  "I've never wanted to sleep with a friend's sibling.",
  "I've never wanted to hook up with someone present.",
  "I've never had sexual fantasies about someone I didn't consider attractive.",
  "I've never done it without a condom.",
  "I've never finished in someone's mouth/had someone finish in my mouth.",
  "I've never wanted to sleep with a friend's boyfriend/girlfriend.",
  "I've never been asked to go slower because I was going too fast.",
  "I've never left someone unsatisfied.",
  "I've never been left unsatisfied.",
  "I've never had the typical 'lights on/lights off' discussion.",
  "I've never found a hair in my mouth after performing oral sex.",
  "I've never cheated.",
  "I've never been cheated on.",
  "I've never doubted my sexual orientation.",
  "I've never hooked up with two people of different genders in one night.",
  "I've never hooked up with someone and regretted it immediately after.",
  "I've never had sex out of pity.",
  "I've never slept with my ex.",
  "I've never been caught in the act.",
  "I've never done it in a public place.",
  "I've never done it in someone else's bed.",
  "I've never done it with more people around.",
  "I've never had a threesome.",
  "I've never had sexual fantasies about having a threesome with my boyfriend/girlfriend and another person.",
  "I've never masturbated with an inanimate object.",
  "I've never hurt myself while masturbating.",
  "I've never been disappointed after hooking up/sleeping with someone I really wanted.",
  "I've never practiced sadomasochism or used related objects.",
  "I've never tried anal but it didn't go well.",
  "I've never practiced anal for pleasure.",
  "I've never hooked up/slept with someone who was at least 5 years older than me.",
  "I've never done something sexual at school/university.",
  "I've never had a hickey in an unusual place.",
  "I've never tried to get someone drunk to hook up with them.",
  "I've never watched porn with another person.",
  "I've never recorded myself with someone in bed.",
  "I've never masturbated to a non-pornographic movie.",
  "I've never had erectile dysfunction.",
  "I've never done it while menstruating.",
  "I've never wanted to hook up with more than 2 people present.",
  "I've never done it dressed up to satisfy a fetish.",
  "I've never hooked up with the person my friend was trying to flirt with.",
  "I've never swallowed.",
  "I've never been aroused at a very inappropriate moment.",
  "I've never had a condom break on me.",
  "I've never gone a year without sex after having done it previously.",
  "I've never put on/had a condom put on me with someone's mouth.",
  "I've never involved food in sex.",
  "I've never done it at a party.",
  "I've never taken/bought the morning-after pill.",
  "I've never had phone sex.",
  "I've never had to rush to find my clothes because someone rang the doorbell.",
  "I've never stopped hooking up/s to aske them how they're called",
  "I've never hooked up/slept with a friend's ex.",
  "I've never lied to my new partner about my sexual experiences.",
  "I've never had to teach/been taught how to unhook a bra.",
  "I've never had a sexual fantasy about a teacher.",
  "I've never caught my parents doing it.",
  "I've never taken nude photos of myself.",
  "I've never called someone the wrong name while we were doing it.",
  "I've never had my ass licked/licked someone's ass.",
  "I've never done it in the shower.",
  "I've never used the Kamasutra to learn or involve new positions in bed.",
  "I've never done it with someone who was a virgin.",
  "I've never lied about being a virgin.",
  "I've never measured my penis.",
  "I've never deleted explicit conversations so my partner wouldn't catch me.",
  "I've never hooked up/slept with someone I didn't find attractive just because I was desperate.",
  "I've never thought I had contracted a sexually transmitted disease.",
  "I've never faked/exaggerated an orgasm.",
  "I've never had a friends with benefits situation.",
  "I've never left the house without underwear.",
  "I've never hooked up/slept with a foreigner.",
  "I've never been envious when seeing a friend's genitals.",
  "I've never masturbated at a friend's house.",
  "I've never had/given a blowjob with a condom.",
  "I've never used ice in bed.",
  "I've never asked to have a fetish fulfilled but without success.",
  "I've never tried to hide an erection in public without success.",
  "I've never been turned on by violence in bed.",
  "I've never farted during sex/had someone fart during sex.",
  "I've never ripped my partner's clothes off.",
  "I've never tried/wanted a couple to break up.",
  "I've never had a 'titty fuck'.",
  "I've never masturbated while watching hentai.",
  "I've never agreed to do something for money.",
  "I've never inserted/had more than three fingers inserted.",
  "I've never done it in a car and honked the horn.",
  "I've never been shown a picture of someone I hooked up with because I didn't remember.",
  "I've never shaved my genitals thinking I was going to score and ended up not getting any action.",
  "I've never wanted to join two friends who were doing it.",
  "I've never made a list of all the guys/girls I've hooked up with.",
  "I've never managed to hook up/sleep with a platonic love.",
  "I've never had to use more than two condoms in the same round.",
  "I've never done it in every room of my/their house.",
  "I've never asked on Chatroulette/Omegle for someone to show me their penis/breasts.",
  "I've never had to use online dating sites or apps to hook up.",
  "I've never realized someone was watching me while I was doing it.",
  "I've never hooked up with someone in the room.",
  "I've never hooked up/slept with someone I didn't like.",
  "I've never finished on someone's body.",
  "I've never been slapped for flirting.",
  "I've never regretted who I lost my virginity with.",
  "I've never hooked up with someone who had just vomited.",
  "I've never been attracted to someone without realizing they were at least 4 years younger than me.",
  "I've never dated someone knowing I wouldn't be with them for long.",
  "I've never done a 69.",
  "I've never done it with our parents nearby.",
  "I've never flirted with someone just to make someone else jealous.",
  "I've never slipped while doing it in the shower.",
  "I've never told someone 'I love you' just to have sex.",
  "I've never made someone bleed or been made to bleed by having fingers inserted.",
  "I've never had terrible sex.",
  "I've never masturbated at least 5 times in a day.",
  "I've never had a wet dream.",
  "I've never thought oral sex was disgusting.",
  "I've never thought oral sex was better than penetration.",
  "I've never thought of someone else while doing it with someone.",
  "I've never done it with someone who, in my opinion, had a small penis.",
  "I've never used flavored condoms.",
  "I've never finished inside without a condom.",
  "I've never kept nude photos of my ex after breaking up with them.",
  "I've never used or had someone use the withdrawal method as a contraceptive with me.",
  "I've never hooked up with someone who had a boyfriend/girlfriend.",
  "A relative of my partner has never flirted with me.",
  "I've never put someone in the friend zone after hooking up with them.",
  "I've never been happy about something bad happening to my ex.",
  "I've never done it more than 5 times in a day.",
  "I've never hooked up with someone from my current class.",
  "I've never experienced a real rejection.",
  "I've never regretted a tattoo.",
  "Doing it outside of the house has never been more exciting for me than inside.",
  "I've never fallen asleep during sex.",
  "I've never had a crush on someone while I had a boyfriend/girlfriend.",
  "I've never broken up with a partner because the sex was unsatisfying.",
  "I've never broken a bed while doing it.",
  "My neighbors have never complained about the noise during sex.",
  "I've never had or given a rough hair-pulling during sex.",
  "I've never lasted less than 10 minutes in bed.",
  "They've never lasted less than 10 minutes in bed with me.",
  "I've never done it 3 or more times in a row.",
  "I've never woken someone up with oral sex or been woken up that way.",
  "I've never masturbated during a video call with someone.",
  "I've never created a fake social media account to see what my ex was doing without them realizing it.",
  "I've never managed to hook up or date someone I was previously friend-zoned by.",
  "My parents have never caught me with a hickey.",
  "I would never have a relationship with someone present if the opportunity arose.",
  "I have never watched step-sibling/stepfather/stepmother porn.",
  "I have never given/received deepthroat.",
  "I have never felt bad about myself after touching myself.",
  "I have never played along with a teacher who was hitting on me.",
  "I have never asked to make a porn video but without success.",
  "I have never pretended to be of another nationality to flirt.",
  "I have never had interracial sex.",
  "I have never been frustrated because sex with someone I cared about was not satisfying.",
  "I have never masturbated in a group.",
  "I have never been obsessed with someone, wholly or partially, after hooking up with them once.",
  "I have never licked nipples.",
  "I have never had my nipples licked.",
  "I have never been in the friendzone with someone present.",
  "I have never broken up with someone to be with another person.",
  "Someone has never broken up with me to be with another person.",
  "I have never had sex while being sick.",
  "I have never wanted to have sex with my best friend.",
  "I have never preferred butts to breasts.",
  "I have never had a rivalry with my ex's boyfriend/girlfriend.",
  "I have never thought that I would marry an ex or current partner.",
  "I have never dreamed of hooking up with someone and felt disappointed when I woke up.",
  "I have never hooked up with someone who had terrible breath.",
  "I have never been hurt while performing oral sex.",
  "I have never been paranoid about being pregnant because my period was late.",
  "I have never given/received a blowjob while driving.",
  "I have never played along with someone hitting on me just to get alcohol.",
  "I have never seen a sex toy and felt curious.",
  "I have never had a sexual dream about someone present/in my class.",
  "I have never been intrigued by the idea of performing oral sex on someone of my same sex.",
  "I have never thought that same-sex intercourse would be better than intercourse between different sexes.",
  "I have never felt attracted to a family member.",
  "I have never sucked a penis/vagina that tasted terrible.",
  "My pet has never interrupted me while having sex.",
  "I have never accidentally used the wrong hole.",
  "I have never masturbated right before sex to last longer.",
  "I have never used a porn video as a model to follow.",
  "I have never dressed a certain way to attract someone's attention and they ignored me.",
  "I have never rented a hotel or motel room just to have sex.",
  "I would never have a threesome with people present here.",
  "I have never played a game with a striptease as the punishment.",
  "I have never hooked up with someone who was a terrible kisser.",
  "I have never used my phone while having sex.",
  "I have never had sex while maintaining zero eye contact with the other person.",
  "I have never been put off by how much pubic hair the person I was going to have sex with had.",
  "I have never laughed while having sex.",
  "I have never jokingly hit on someone, and it turned out better than expected.",
  "I have never hooked up with/had sex with my ex's best friend.",
  "I have never taken sensual nude photos to send to someone.",
  "I have never believed that someone present has hit on me before."
]
